app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Stoneberg"], ["updated_at", "2021-01-05 01:45:38.884366"], ["id", 3]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params)